#个税计算
'''
题目
企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；
    利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
    20万到40万之间时，高于20万元的部分，可提成5%；
    40万到60万之间时高于40万元的部分，可提成3%；
    60万到100万之间时，高于60万元的部分，可提成1.5%，
    高于100万元时，超过100万元的部分按1%提成，
    从键盘输入当月利润I，求应发放奖金总数？
'''
#从键盘上输入 并且转换成整数
money = int(input("input money:"))
bonus = 0
if money / 10000 > 1 :
    print(money)
    money /= 10000
    print("除了10000之后", money)
    if money >= 100 :
        bonus = (money - 100) * 10000 * 0.01 + 400000 * 0.015 + 200000 * 0.03 + 200000 * 0.05 + 100000 * 0.075 + 100000 * 0.1
    elif money < 100 and money >= 60:
        bonus = (money - 60) * 10000 * 0.015 + 200000 * 0.03 + 200000 * 0.05 + 100000 * 0.075 + 100000 * 0.1
    elif money < 60 and money >= 40:
        bonus = (money - 40) * 10000 * 0.03 + 200000 * 0.05 + 100000 * 0.075 + 100000 * 0.1
    elif money < 40 and money >= 20:
        bonus = (money - 20) * 10000 * 0.05 + 100000 * 0.075 + 100000 * 0.1
    elif money < 20 and money >= 10:
        bonus = (money - 10) * 10000 * 0.075 + 100000 * 0.1
    else:
        bonus = 100000 * 0.1
else:
    bonus = 100000 * 0.1
print(bonus)